import { NextPage } from "next";
import s from "./page.module.scss";
import Image from "next/image";

const Page: NextPage = ({}) => {
  return (
    <div className={s.Page}>
      <h1 className={s.Page__title}>О компании</h1>
      <div className={s.Page__content}>
        <div className={s.Page__content__wrapper}>
          <div className={s.Page__content__text}>
            <p>
              Мы - ведущий информационный ресурс, посвященный самым актуальным новостям и достижениям в области медицины и здравоохранения. Наша
              миссия - предоставлять читателям достоверную, объективную и своевременную информацию о медицинских инновациях, открытиях, исследованиях
              и событиях, которые меняют жизнь людей к лучшему.
            </p>
            <p>
              На нашем сайте вы найдете новости о прорывах в диагностике и лечении различных заболеваний, обзоры новых лекарственных препаратов и
              медицинских технологий, интервью с ведущими врачами и учеными. Мы также освещаем вопросы организации здравоохранения, новые программы и
              инициативы, направленные на улучшение качества медицинской помощи.
            </p>
          </div>
          <Image
            src="/AboutImage1.jpg"
            className={s.Page__content__image}
            width={605}
            height={200}
            alt="Фотография"
            style={{ objectFit: "cover", borderRadius: "10px" }}
          />
        </div>
        <div className={s.Page__content__wrapper}>
          <Image
            src="/AboutImage2.jpg"
            className={s.Page__content__image}
            width={605}
            height={200}
            alt="Фотография"
            style={{ objectFit: "cover", borderRadius: "10px" }}
          />
          <div className={s.Page__content__text}>
            <p>
              Наша команда состоит из профессиональных журналистов, имеющих опыт работы в медицинской сфере. Мы тщательно проверяем все факты и
              используем только достоверные источники, чтобы предоставлять нашим читателям максимально полную и достоверную информацию.
            </p>
            <p>
              Мы стремимся быть надежным и авторитетным источником медицинских новостей, помогая людям быть в курсе последних достижений, которые
              могут изменить и улучшить их жизнь. Присоединяйтесь к нам, чтобы всегда быть в курсе важнейших медицинских событий!
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Page;
