BEGIN;

CREATE TABLE IF NOT EXISTS news(
    id bigserial not null primary key,
    title text not null,
    body text not null,
    photo text not null,
    is_active boolean not null default true
);

COMMIT;

BEGIN;

INSERT INTO news (title, body, photo) VALUES ('Высокотехнологическая лаборатория в борьбе с раком', 'Лаборатория была создана при поддержке государственных и частных инвестиций в рамках национальной программы по борьбе с онкологическими заболеваниями. В оснащение центра вложены беспрецедентные средства, позволившие закупить самое современное диагностическое оборудование.
"Это настоящий прорыв в области медицинских технологий, - говорит директор лаборатории, доктор Ольга Петрова. - Теперь мы можем выявлять онкологические заболевания на ранних стадиях с небывалой точностью. Это позволит значительно повысить эффективность лечения и спасти множество жизней".
Главной особенностью лаборатории является использование передовых методик молекулярной диагностики. Благодаря секвенированию ДНК, компьютерной томографии высокого разрешения и другим инновационным технологиям, врачи способны с высочайшей точностью определять тип опухоли, ее стадию развития и разрабатывать максимально эффективную схему лечения для каждого пациента. 
Кроме того, лаборатория оснащена по последнему слову техники для проведения фундаментальных научных исследований в области онкологии. Здесь трудятся ведущие ученые, которые занимаются поиском новых методов ранней диагностики и персонализированной терапии рака.
"Открытие этого центра - огромный шаг вперед в нашей борьбе с раком, - говорит министр здравоохранения региона Иван Сидоров. - Теперь у нас есть все необходимые ресурсы, чтобы выявлять заболевание на ранних стадиях и применять самые передовые методы лечения. Это позволит значительно повысить выживаемость онкологических пациентов и дать им шанс на полноценную жизнь".
Жители города N и всего региона могут воспользоваться услугами новой высокотехнологичной лаборатории. Ее двери открыты для всех, кто заботится о своем здоровье и хочет пройти своевременную онкодиагностику.', 'C:\Users\Владислав\Kyrsovaya\public\MainContentCardImage1.jpg');

INSERT INTO news (title, body, photo) VALUES ('Новый прорыв в лечении детского рака', 'Учёные из международной исследовательской группы сообщили о значительном прорыве в области лечения детского рака. Новый метод, основанный на персонализированной иммунотерапии, продемонстрировал многообещающие результаты в клинических испытаниях, значительно улучшив шансы на выживание у детей, страдающих от редких и агрессивных форм опухолей.

Технология, разработанная учеными, использует новейшие достижения в области генной инженерии для создания индивидуализированных лекарств, которые воздействуют на клетки опухолей, оставляя здоровые ткани нетронутыми. В отличие от традиционных методов, таких как химиотерапия и облучение, данный подход значительно снижает побочные эффекты и ускоряет восстановление организма.

Исследования, проведенные в нескольких странах, показали, что дети, участвующие в экспериментальных клинических испытаниях, продемонстрировали улучшение состояния и долгосрочную ремиссию, что является уникальным результатом для данной категории пациентов.

"Этот метод может стать настоящим прорывом в лечении рака у детей, он открывает новые горизонты для борьбы с заболеваниями, которые ранее считались неизлечимыми," — заявили ученые, участвующие в разработке.

Прорыв в области лечения детского рака также получил поддержку от крупных медицинских фондов и организаций, которые обещают продолжить финансирование исследований, чтобы ускорить внедрение новой терапии в клиническую практику.', 'C:\Users\Владислав\Kyrsovaya\public\MainContentCardImage2.jpg');

INSERT INTO news (title, body, photo) VALUES ('Виртуозный хирург спасает жизни', 'Известный хирург, доктор Игорь Смирнов, совершил настоящий прорыв в медицине, спасая жизни пациентов с самыми сложными и опасными диагнозами. Его мастерство и уникальные методы работы стали настоящим спасением для людей, которым традиционная медицина уже не могла помочь.

Доктор Смирнов, специализирующийся на высокотехнологичных и малоинвазивных операциях, стал известен благодаря своей способности проводить невероятно сложные процедуры с минимальными рисками для пациентов. Его отличает не только высокий уровень квалификации, но и инновационные подходы, которые он использует в своей практике. Среди них — уникальные методики, позволяющие добиться точности в операциях на внутренних органах, даже в самых труднодоступных местах.

«Каждая операция — это не просто технический процесс, а решение задачи, где важен каждый миллиметр и каждый момент. Я всегда стремлюсь к тому, чтобы пациент не только выжил, но и вернулся к полноценной жизни как можно скорее», — рассказывает доктор Смирнов.

Недавно он провел несколько уникальных операций, которые стали настоящими медицинскими чудесами. Одним из таких случаев стал редкий случай спасения пациента с внутренними повреждениями после автокатастрофы. В результате вмешательства доктора Смирнова, несмотря на угрозу для жизни, пациент не только выжил, но и смог вернуться к активной жизни через несколько месяцев.

Пациенты и коллеги восхищаются его подходом и беспрецедентной точностью. В своем стремлении к совершенству врач применяет самые современные технологии, включая роботизированные хирургические системы и 3D-моделирование органов перед операциями, что позволяет минимизировать риски и сделать процедуры максимально безопасными.', 'C:\Users\Владислав\Kyrsovaya\public\MainContentCardImage3.jpg');

INSERT INTO news (title, body, photo) VALUES ('Революционная таблетка против рака', 'Учёные сообщили о создании революционной таблетки, способной существенно изменить подход к лечению рака. Новый препарат, прошедший успешные клинические испытания, оказался эффективным в борьбе с различными видами опухолей, включая те, которые традиционно считались трудноизлечимыми.

Таблетка, разработанная группой учёных из ведущих международных исследовательских центров, использует уникальный механизм воздействия на раковые клетки, не повреждая здоровые ткани организма. Это делает лечение значительно менее травматичным по сравнению с традиционными методами, такими как химиотерапия и облучение, которые часто сопровождаются тяжёлыми побочными эффектами.

«Мы наблюдаем уникальные результаты. Препарат не только блокирует рост опухолей, но и помогает иммунной системе распознавать и уничтожать раковые клетки. Это настоящий прорыв в онкологии», — заявил профессор Алексей Иванов, один из разработчиков лекарства.

Революционная таблетка уже показала свою эффективность при лечении рака лёгких, груди и кишечника, а также у пациентов с редкими метастазами. В некоторых случаях удавалось добиться полного исчезновения опухолей, что до сих пор оставалось недостижимым для традиционных методов лечения.

Пациенты, принимавшие новый препарат, отмечают значительное улучшение состояния, снижение болевых ощущений и улучшение качества жизни, что делает революционную таблетку важным шагом к победе над раком.

На данный момент компания-разработчик планирует расширить клинические испытания и в скором времени подать заявку на регистрацию препарата в мировых медицинских регуляторах. Прогнозы экспертов на будущее весьма оптимистичны, и многие уже называют эту таблетку «лекарством будущего», которое откроет новые горизонты в лечении онкологических заболеваний.

Этот прорыв в области медицины даёт надежду миллионам людей по всему миру, открывая новые перспективы для тех, кто борется с раком.', 'C:\Users\Владислав\Kyrsovaya\public\MainContentCardImage4.jpg');

COMMIT;